app/controllers/polls_controller.rb

  def index
    @polls = Poll.all
---
SELECT "polls".* FROM "polls"

  def show
    @poll = Poll.find(params[:id])

    #@yes_percentage = trues / @poll.answers.count.to_f
    #@username = @answer.number.last(4)

    trues = 0
    falses = 0
    @poll.answers.each do |a|
---
SELECT "polls".* FROM "polls" WHERE "polls"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "answers".* FROM "answers" WHERE "answers"."poll_id" = 1

  def edit
    @poll = Poll.find(params[:id])
---
SELECT "polls".* FROM "polls" WHERE "polls"."id" = $1 LIMIT 1  [["id", "1"]]

  def create_answer
    @answer = Answer.new
    logger.debug @answer
    return if params[:From].blank?
    if params[:Body] == true || params[:Body] =~ (/(true|True|TRUE|t|yes|Yes|YES|y|Y|1)$/i)
      @answer.affirmative = true
    elsif params[:Body] == false || params[:Body] =~ (/(false|False|FALSE|f|no|No|NO|n|N|0)$/i)
      @answer.affirmative = false
    end
    @answer.number = params[:From]
    @poll = Poll.find(params[:id])
    @poll.answers << @answer
---
SELECT "polls".* FROM "polls" WHERE "polls"."id" = $1 LIMIT 1  [["id", "1"]]
INSERT INTO "answers" ("affirmative", "created_at", "number", "number_id", "poll_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["affirmative", true], ["created_at", Sat, 20 Oct 2012 05:34:07 UTC +00:00], ["number", "5129640046"], ["number_id", nil], ["poll_id", 1], ["updated_at", Sat, 20 Oct 2012 05:34:07 UTC +00:00]]

  def update
    @poll = Poll.find(params[:id])

    respond_to do |format|
      if @poll.update_attributes(params[:poll])
---
SELECT "polls".* FROM "polls" WHERE "polls"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "polls" SET "description" = 'This poll is better than all the other polls', "updated_at" = '2012-10-20 05:35:08.114818' WHERE "polls"."id" = 1